import contextMenuIcon from "svg/context-menu.svg";

import exampleImage from "static/images/example-image.png";

export default {
  chatImage: "",
  chatName: "Жмышенко В.А.",
  chatData: [
    {
      date: "19 июня",
      messages: [
        {
          type: "text",
          text: "Та я его как нефиг делать. 1. Самое уязвимое место – НЛД. Широкий бронелист пробивается даже танками седьмого уровня, что заставляет многих игроков прятать его за какие-либо укрытия. Именно в этом и кроется формула успеха ИС-7 – «спрятал НЛД и ты имбуешь». 2. Если нет возможности выстрелить в нижний бронелист, то стреляем в места за фарами на ВЛД. За ними находятся снаряды и в большинстве случаев случается крит БК. Выстрел из крупнокалиберного орудия по левой фаре приведет в 90% случаев к подрыву боеукладки и отлету башни. 3. Также на ВЛД легко прошивается триплекс мехвода. Только стрелять нужно именно в рамку триплекса, ибо стоит чуть отодвинуть прицел и «щучий нос» сделает свое грязное дело. 4. Пытаться пробить триплекс на башне – такое себе занятие. Он пробивается разве что в клинче, да и то голдой. 5. В клинче советская семерка является лучшей машиной, однако и тут есть уязвимое место. Когда поднимается ствол, за маской орудия обнажается пространство, в которое легко залетает как фугас на фулку, так и любой снаряд, даже с самым малым бронепробитием.",
          sender: 2,
          isMyMessage: false,
          time: "12:09",
        },
        {
          type: "text",
          text: "Та ты хоть знаешь куда ИС-7 пробивать? А?",
          sender: 1,
          isMyMessage: true,
          time: "12:07",
        },
        {
          type: "text",
          text: "Ни понял. Извинись.",
          sender: 2,
          isMyMessage: false,
          time: "12:05",
        },
        {
          type: "text",
          text: "Хто я? А может быть ты?",
          sender: 1,
          isMyMessage: true,
          time: "12:05",
        },
        {
          type: "text",
          text: "Ты биканул на меня чи как? М? Не слышу?",
          sender: 2,
          isMyMessage: false,
          time: "12:02",
        },
        {
          type: "text",
          text: "М?",
          sender: 2,
          isMyMessage: false,
          time: "12:01",
        },
        {
          type: "text",
          text: "Не слышу?",
          sender: 2,
          isMyMessage: false,
          time: "12:01",
        },
        {
          type: "text",
          text: "Та мине абсолютно чисто крыстально по",
          sender: 1,
          isMyMessage: true,
          time: "12:00",
        },
        {
          type: "image",
          image: exampleImage,
          isMyMessage: false,
          sender: 2,
          time: "11:57",
        },
        {
          type: "text",
          text: `Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой.

          Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро. евро евроевроевроевроевроевроевроевроевроевроsd`,
          sender: 2,
          isMyMessage: false,
          time: "11:56",
        },
      ],
    },
    {
      date: "15 июня",
      messages: [
        {
          type: "text",
          text: "Та я его как нефиг делать. 1. Самое уязвимое место – НЛД. Широкий бронелист пробивается даже танками седьмого уровня, что заставляет многих игроков прятать его за какие-либо укрытия. Именно в этом и кроется формула успеха ИС-7 – «спрятал НЛД и ты имбуешь». 2. Если нет возможности выстрелить в нижний бронелист, то стреляем в места за фарами на ВЛД. За ними находятся снаряды и в большинстве случаев случается крит БК. Выстрел из крупнокалиберного орудия по левой фаре приведет в 90% случаев к подрыву боеукладки и отлету башни. 3. Также на ВЛД легко прошивается триплекс мехвода. Только стрелять нужно именно в рамку триплекса, ибо стоит чуть отодвинуть прицел и «щучий нос» сделает свое грязное дело. 4. Пытаться пробить триплекс на башне – такое себе занятие. Он пробивается разве что в клинче, да и то голдой. 5. В клинче советская семерка является лучшей машиной, однако и тут есть уязвимое место. Когда поднимается ствол, за маской орудия обнажается пространство, в которое легко залетает как фугас на фулку, так и любой снаряд, даже с самым малым бронепробитием.",
          sender: 2,
          isMyMessage: false,
          time: "12:09",
        },
        {
          type: "text",
          text: "Та ты хоть знаешь куда ИС-7 пробивать? А?",
          sender: 1,
          isMyMessage: true,
          time: "12:07",
        },
        {
          type: "text",
          text: "Ни понял. Извинись.",
          sender: 2,
          isMyMessage: false,
          time: "12:05",
        },
        {
          type: "text",
          text: "Хто я? А может быть ты?",
          sender: 1,
          isMyMessage: true,
          time: "12:05",
        },
        {
          type: "text",
          text: "Ты биканул на меня чи как? М? Не слышу?",
          sender: 2,
          isMyMessage: false,
          time: "12:02",
        },
        {
          type: "text",
          text: "Та мине абсолютно чисто крыстально по",
          sender: 1,
          time: "12:00",
          isMyMessage: true,
        },
        {
          type: "image",
          image: exampleImage,
          sender: 2,
          isMyMessage: false,
          time: "11:57",
        },
        {
          type: "text",
          text: `Привет! Смотри, тут всплыл интересный кусок лунной космической истории — НАСА в какой-то момент попросила Хассельблад адаптировать модель SWC для полетов на Луну. Сейчас мы все знаем что астронавты летали с моделью 500 EL — и к слову говоря, все тушки этих камер все еще находятся на поверхности Луны, так как астронавты с собой забрали только кассеты с пленкой.

          Хассельблад в итоге адаптировал SWC для космоса, но что-то пошло не так и на ракету они так никогда и не попали. Всего их было произведено 25 штук, одну из них недавно продали на аукционе за 45000 евро.`,
          sender: 2,
          isMyMessage: false,
          time: "11:56",
        },
      ],
    },
  ],
  menuSettings: {
    buttonClass: "chats__context-menu",
    icon: {
      type: "button",
      src: contextMenuIcon,
      alt: "Иконка контекстного меню",
    },
  },
};
